tripmine253/massdrop_qmk/tmk_core/protocol/arm_atsam/usb/usb2422.c
    DBGC(DC_USB_WRITE2422_BLOCK_COMPLETE);
}


void USB_reset(void) {
    DBGC(DC_USB_RESET_BEGIN);

    //pulse reset for at least 1 usec
    sr_exp_data.bit.HUB_RESET_N = 0; //reset low to reset
    SR_EXP_WriteData();
    wait_us(2);
    sr_exp_data.bit.HUB_RESET_N = 1; //reset high to run
    SR_EXP_WriteData();

    wait_ms(10);

    DBGC(DC_USB_RESET_COMPLETE);
}

void USB_configure(void) {
    Usb2422 *pusb2422 = &USB2422_shadow;
    memset(pusb2422, 0, sizeof(Usb2422));

    uint16_t *serial_use = (uint16_t *)SERNAME; //Default to use SERNAME from this file
    uint8_t serial_length = sizeof(SERNAME) / sizeof(uint16_t); //Default to use SERNAME from this file
#ifndef MD_BOOTLOADER
    uint32_t serial_ptrloc = (uint32_t)&_srom - 4;
#else //MD_BOOTLOADER
    uint32_t serial_ptrloc = (uint32_t)&_erom - 4;
#endif //MD_BOOTLOADER
    uint32_t serial_address = *(uint32_t *)serial_ptrloc; //Address of bootloader's serial number if available

    DBGC(DC_USB_CONFIGURE_BEGIN);

    if (serial_address != 0xFFFFFFFF && serial_address < serial_ptrloc) {   //Check for factory programmed serial address
        if ((serial_address & 0xFF) % 4 == 0) {                             //Check alignment
            serial_use = (uint16_t *)(serial_address);
            serial_length = 0;
            while ((*(serial_use + serial_length) > 32 && *(serial_use + serial_length) < 127) &&
                   serial_length < BOOTLOADER_SERIAL_MAX_SIZE) {
                serial_length++;
                DBGC(DC_USB_CONFIGURE_GET_SERIAL);
            }
        }
    }

    //configure Usb2422 registers
    pusb2422->VID.reg = 0x04D8; // from Microchip 4/19/2018
    pusb2422->PID.reg = 0xEEC5; // from Microchip 4/19/2018 = Massdrop, Inc. USB Hub
    pusb2422->DID.reg = 0x0101; // BCD 01.01
    pusb2422->CFG1.bit.SELF_BUS_PWR = 1; // self powered for now
    pusb2422->CFG1.bit.HS_DISABLE = 1; // full or high speed
    //pusb2422->CFG2.bit.COMPOUND = 0; // compound device
    pusb2422->CFG3.bit.STRING_EN = 1; // strings enabled
    //pusb2422->NRD.bit.PORT2_NR = 0; // MCU is non-removable
    pusb2422->MAXPB.reg = 20; // 0mA
    pusb2422->HCMCB.reg = 20; // 0mA
    pusb2422->MFRSL.reg = sizeof(MFRNAME) / sizeof(uint16_t);
    pusb2422->PRDSL.reg = sizeof(PRDNAME) / sizeof(uint16_t);
    pusb2422->SERSL.reg = serial_length;
    memcpy(pusb2422->MFRSTR, MFRNAME, sizeof(MFRNAME));
    memcpy(pusb2422->PRDSTR, PRDNAME, sizeof(PRDNAME));
    memcpy(pusb2422->SERSTR, serial_use, serial_length * sizeof(uint16_t));
    //pusb2422->BOOSTUP.bit.BOOST=3;    //upstream port
    //pusb2422->BOOSTDOWN.bit.BOOST1=0; // extra port
    //pusb2422->BOOSTDOWN.bit.BOOST2=2; //MCU is close
    pusb2422->STCD.bit.USB_ATTACH = 1;
    USB_write2422_block();

    DBGC(DC_USB_CONFIGURE_COMPLETE);
}

uint16_t USB_active(void) {
    return (PORT->Group[USB2422_HUB_ACTIVE_GROUP].IN.reg & (1 << USB2422_HUB_ACTIVE_PIN)) != 0;
}

#define USB_DETECT_INIT_VAL     100         //Default value for rp/cc detection to test against after routines
#define USB_DETECT_METHOD_NONE  0
#define USB_DETECT_METHOD_RP    1
#define USB_DETECT_METHOD_V     2

//Return best Rp value match
uint8_t USB_detect_host(void) {
    static uint8_t usb_detect_onb_ext = 0;
    uint8_t rp_best_index = 0;

    DBGC(DC_USB_DETECT_HOST_BEGIN);

    g_usb_host_port = USB_HOST_PORT_UNKNOWN;                                        //Initialize host port as unknown

    usb_init_host_detection_kb();                                                   //Run keyboard specific initialization

    wait_ms(100);                                                                   //Allow power dissapation time on CC lines

    while (adc_get(ADC_5V) < ADC_5V_V2C(ADC_5V_START_LEVEL)) { DBGC(DC_USB_DETECT_HOST_5V_LOW_WAITING); } //Assert 5V bus adequate

    uint8_t detect_method = USB_DETECT_METHOD_NONE;                                 //Initial detection method
    uint8_t adc_cc_index[] = { ADC_C1A5, ADC_C1B5, ADC_C2A5, ADC_C2B5 };            //Initialize CC lines array
    uint16_t cc_readings[] = { 0, 0, 0, 0 };                                        //Initialize CC readings array
    uint8_t cc_index;
    uint8_t cc_index_max = sizeof(adc_cc_index) / sizeof(*adc_cc_index);

    //Collect CC readings for decision making processes
    for (cc_index = 0; cc_index < cc_index_max; cc_index++) {                       //For each CC line
        cc_readings[cc_index] = adc_get(adc_cc_index[cc_index]);                    //Perform ADC reading
        if (cc_readings[cc_index] == (uint16_t)ADC_NA) {                            //If the ADC was not available for reading
            cc_readings[cc_index] = 0;                                              //Set value low to not be used
            continue;                                                               //ADC not available so skip
        }

        cc_readings[cc_index] = ADC_CC_5VCOR(adc_get(ADC_5V), cc_readings[cc_index]); //Correct the ADC reading according to 5V bus
    }

#ifdef ADC_USBC_RP_DELTA_MAX
    if (detect_method == USB_DETECT_METHOD_NONE) {                                      //If a detection method has not succeeded yet
        //Using CC readings, test them for onb or ext
        uint16_t rp_delta_least = 5000;                                                 //Initialize to a high number out of ADC range
        uint16_t rp_delta;                                                              //Distance of reading to a test value
        uint8_t rp_index;                                                               //Index of Rp value being tested
        uint8_t cc_best_index = USB_DETECT_INIT_VAL;                                    //Initialize to a high number out of index

        rp_best_index = USB_DETECT_INIT_VAL;                                            //Initialize to a high number out of index
        for (cc_index = 0; cc_index < cc_index_max; cc_index++) {                       //For each CC line
            for (rp_index = 0; rp_index < ADC_USBC_TYPES; rp_index++) {                 //For each Rp
                rp_delta = abs(cc_readings[cc_index] - adc_usbc_rp_nominal[rp_index]);  //Calculate the distance between reading and Rp
                if (rp_delta < rp_delta_least && rp_delta < ADC_USBC_RP_DELTA_MAX) {    //If the distance is less than the least and within distance cap
                    rp_delta_least = rp_delta;                                          //Save the least rp distance
                    rp_best_index = rp_index;                                           //Save the closest Rp value index
                    cc_best_index = adc_cc_index[cc_index];                             //Save the closest CC line index
                }
            }
        }

        //Set up host port and extra port according to detection
        if (rp_best_index != USB_DETECT_INIT_VAL) {                                     //If a decision was made
            if (cc_best_index == ADC_C1A5 || cc_best_index == ADC_C1B5) {               //If on CON1
                usb_set_host_kb(1, rp_best_index);                                      //Set up host port on CON1 (rp used to set onb/ext)
                usb_set_extra_kb(2);                                                    //Set up extra port on CON2
                detect_method = USB_DETECT_METHOD_RP;                                   //Set detection method used
            } else if (cc_best_index == ADC_C2A5 || cc_best_index == ADC_C2B5) {        //Else if on CON2
                usb_set_host_kb(2, rp_best_index);                                      //Set up host port on CON2 (rp used to set onb/ext)
                usb_set_extra_kb(1);                                                    //Set up extra port on CON1
                detect_method = USB_DETECT_METHOD_RP;                                   //Set detection method used
            }
        }
    }
#endif

    //Detect highest voltage port and test onboard or external
    if (detect_method == USB_DETECT_METHOD_NONE) {                                  //If a detection method has not succeeded yet
        uint16_t rp_highest_v = 0;                                                  //Initialize to the lowest number possible
        uint8_t v_best_index = USB_DETECT_INIT_VAL;                                 //Initialize to the lowest number possible
        for (cc_index = 0; cc_index < cc_index_max; cc_index++) {                   //For each CC line
            if (cc_readings[cc_index] > rp_highest_v) {                             //Keep track of the highest voltage level as a secondary host detection method
                rp_highest_v = cc_readings[cc_index];                               //Save the highest voltage
                v_best_index = adc_cc_index[cc_index];                              //Save the highest voltage index
            }
        }

        //Set up host port and extra port according to detection
        usb_detect_onb_ext = !usb_detect_onb_ext;                                   //Swap onb/ext detect for this run
        rp_best_index = usb_detect_onb_ext;                                         //Force onb/ext setting
        if (v_best_index == ADC_C1A5 || v_best_index == ADC_C1B5) {                 //If on CON1
            usb_set_host_kb(1, rp_best_index);                                      //Set up host port on CON1
            usb_set_extra_kb(2);                                                    //Set up extra port on CON2
            detect_method = USB_DETECT_METHOD_V;                                    //Set detection method used
        } else if (v_best_index == ADC_C2A5 || v_best_index == ADC_C2B5) {          //Else if on CON2
            usb_set_host_kb(2, rp_best_index);                                      //Set up host port on CON2
            usb_set_extra_kb(1);                                                    //Set up extra port on CON1
            detect_method = USB_DETECT_METHOD_V;                                    //Set detection method used
        }
    }

