tripmine253/massdrop_qmk/tmk_core/protocol/arm_atsam/usb/usb2422.c
    if (detect_method != USB_DETECT_METHOD_NONE) {                                  //If a detection method succeeded
        wait_ms(20);                                                                //Allow settling time for switching
        USB_reset();                                                                //Reset and enable the USB Hub
        USB_configure();                                                            //Configure the USB Hub and send attach
    }

    DBGC(DC_USB_DETECT_HOST_COMPLETE);

    return rp_best_index;
}

uint8_t USB2422_Port_Detect_Init(void) {
    uint32_t tmod;
    uint8_t led_state = 0;
    uint64_t port_detect_fail_ms;
    static uint8_t port_detect_retry_counter = 0;
    static uint16_t port_detect_retry_ms = 0;

    DBGC(DC_PORT_DETECT_INIT_BEGIN);

#ifdef ADC_USBC_IS_EXT
    //If the keyboard supports offboard USB extenders, rp_best_index is used to determine onboard/offboard usage
    uint8_t rp_best_index = USB_detect_host();
#else
    USB_detect_host();
#endif

    port_detect_fail_ms = timer_read64() + PORT_DETECT_RETRY_START + port_detect_retry_ms;
    uint32_t port_flash_counter = timer_read();

    while (!USB_active()) {
        tmod = (timer_read() - port_flash_counter);
        if (USB_HOST_IS_1(g_usb_host_port)) {
            //1 flash for port 1 detected (dit), additional long flash if external port (dit-dah)
            if (tmod > 500 && tmod < 600) {
                if (!led_state) { DBG_LED_ON; led_state = 1; }
            }
#ifdef ADC_USBC_IS_EXT
            else if (ADC_USBC_IS_EXT(rp_best_index) && tmod > 1000 && tmod < 1500) {
                if (!led_state) { DBG_LED_ON; led_state = 1; }
            }
#endif
            else if (led_state) { DBG_LED_OFF; led_state = 0; }
        } else if (USB_HOST_IS_2(g_usb_host_port)) {
            //2 flash for port 2 detected (dit-dit), additional long flash if external port (dit-dit-dah)
            if (tmod > 500 && tmod < 600) {
                if (!led_state) { DBG_LED_ON; led_state = 1; }
            } else if (tmod > 700 && tmod < 800) {
                if (!led_state) { DBG_LED_ON; led_state = 1; }
            }
#ifdef ADC_USBC_IS_EXT
            else if (ADC_USBC_IS_EXT(rp_best_index) && tmod > 1000 && tmod < 1500) {
                if (!led_state) { DBG_LED_ON; led_state = 1; }
            }
#endif
            else if (led_state) { DBG_LED_OFF; led_state = 0; }
        } else {
            //Flash every 250ms if port unknown (should not get here)
            if (tmod % 500 < 250) {
                if (!led_state) { DBG_LED_ON; led_state = 1; }
            } else if (led_state) { DBG_LED_OFF; led_state = 0; }
        }

        if (timer_read64() > port_detect_fail_ms) {                     //If timeout reached
            DBGC(DC_PORT_DETECT_INIT_FAILED);

            port_detect_retry_counter++;                                //Increment retry counter
            if (port_detect_retry_counter % 2 == 0) {                   //Increment timeout every 2 attempts
                port_detect_retry_ms += PORT_DETECT_RETRY_INCREMENT;    //Increment timeout
            }
            if (port_detect_retry_ms > PORT_DETECT_RETRY_MAX) {         //If the new timeout is greater than the max timeout setting
                port_detect_retry_ms = PORT_DETECT_RETRY_MAX;           //Set timeout to max
            }

            return 0;
        }
    }

    DBGC(DC_PORT_DETECT_INIT_COMPLETE);

    return 1;
}

 #ifndef MD_BOOTLOADER

uint16_t usbc_cc_a5_v;
uint16_t usbc_cc_b5_v;
float usbc_cc_a5_v_avg;
float usbc_cc_b5_v_avg;

void usbc_cc_clear(void) {
    usbc_cc_a5_v = 0;
    usbc_cc_b5_v = 0;
    usbc_cc_a5_v_avg = 0.0f;
    usbc_cc_b5_v_avg = 0.0f;
}

//Only poll CC lines for port assigned as EXTRA
uint8_t usbc_cc_update(void) {
    if (USB_HOST_IS_1(g_usb_host_port)) {
        usbc_cc_a5_v = adc_get(ADC_C2A5);
        usbc_cc_b5_v = adc_get(ADC_C2B5);
    } else if (USB_HOST_IS_2(g_usb_host_port)) {
        usbc_cc_a5_v = adc_get(ADC_C1A5);
        usbc_cc_b5_v = adc_get(ADC_C1B5);
    } else {
        return 0;
    }

    usbc_cc_a5_v_avg = 0.9 * usbc_cc_a5_v_avg + 0.1 * (float)usbc_cc_a5_v;
    usbc_cc_b5_v_avg = 0.9 * usbc_cc_b5_v_avg + 0.1 * (float)usbc_cc_b5_v;

    return 1;
}

//Disable 5V bus on extra USB port
//If force_update != 0, force update to run
//If force_update == 0, only update if value is changed
uint8_t usbc_5v_disable(uint8_t force_update) {
    if (USB_HOST_IS_1(g_usb_host_port)) {
        if (force_update || (USBC_CFG_5V2_VAR != USBC_CFG_5V2_DIS)) {
            USBC_CFG_5V2_VAR = USBC_CFG_5V2_DIS;
            USBC_CFG_5V2_UPDATE;
        }
        return 1;
    } else if (USB_HOST_IS_2(g_usb_host_port)) {
        if (force_update || (USBC_CFG_5V1_VAR != USBC_CFG_5V1_DIS)) {
            USBC_CFG_5V1_VAR = USBC_CFG_5V1_DIS;
            USBC_CFG_5V1_UPDATE;
        }
        return 1;
    }

    return 0;
}

//Enable 5V bus on extra USB port
//If force_update != 0, force update to run
//If force_update == 0, only update if value is changed
uint8_t usbc_5v_enable(uint8_t force_update) {
    if (USB_HOST_IS_1(g_usb_host_port)) {
        if (force_update || (USBC_CFG_5V2_VAR != USBC_CFG_5V2_ENA)) {
            USBC_CFG_5V2_VAR = USBC_CFG_5V2_ENA;
            USBC_CFG_5V2_UPDATE;
        }
        return 1;
    } else if (USB_HOST_IS_2(g_usb_host_port)) {
        if (force_update || (USBC_CFG_5V1_VAR != USBC_CFG_5V1_ENA)) {
            USBC_CFG_5V1_VAR = USBC_CFG_5V1_ENA;
            USBC_CFG_5V1_UPDATE;
        }
        return 1;
    }

    return 0;
}

uint8_t usbc_5v_is_enabled(void) {
    if (USB_HOST_IS_1(g_usb_host_port)) {
        if (USBC_CFG_5V2_VAR == USBC_CFG_5V2_ENA) {
            return 1;
        } else {
            return 0;
        }
    } else if (USB_HOST_IS_2(g_usb_host_port)) {
        if (USBC_CFG_5V1_VAR == USBC_CFG_5V1_ENA) {
            return 1;
        } else {
            return 0;
        }
    }

    return 0; //Not sure technically due to unknown host port
}

void usbc_enable(void) {
    usbc_5v_disable(1);                                             //Disable 5V bus
    usbc.state = USB_STATE_UNATTACHED_WAIT_SRC;                     //Set starting state to discharge wait
    usbc.timer = USBC_CFG_TVCONNDISCHARGE;                          //Set timer for 5V bus discharge
    usbc_cc_clear();                                                //Clear CC readings
}

void usbc_disable(void) {
    usbc_5v_disable(1);                                             //Disable 5V bus
    usbc.state = USB_STATE_DISABLED_WAIT;                           //Set disabled waiting state
    usbc.timer = USBC_CFG_TVCONNDISCHARGE;                          //Set timer for 5V bus discharge
    usbc_cc_clear();                                                //Clear CC readings
}

