tripmine253/massdrop_qmk/tmk_core/protocol/arm_atsam/usb/usb2422.c
//This macro updates the timer and returns true if timer is complete
#define USBC_TIMER_DONE (0 == (usbc.timer = (usbc.timer > USBC_CFG_PERIOD ? usbc.timer - USBC_CFG_PERIOD : 0)))

void usbc_task(void) {
    if (usbc.state == USB_STATE_UNATTACHED_SRC) {
        //Connection detected -> USB_STATE_ATTACH_WAIT_SRC

        usbc.timer = 0;                                             //Note: Changes to this state do not require clearing timer at change

        if (usbc_cc_update()) {                                     //Must have valid readings to continue
            if (USBC_IS_SINK((uint16_t)usbc_cc_a5_v_avg, (uint16_t)usbc_cc_b5_v_avg)) { //If Sink detected
                usbc.state = USB_STATE_ATTACH_WAIT_SRC;             //Set next state
                usbc.timer = USBC_CFG_TCCDEBOUNCE;                  //Set timer
            } else {
                return;                                             //Nothing more to be done
            }
        }
    }

    if (usbc.state == USB_STATE_ATTACH_WAIT_SRC) {
        //Connection removed -> USB_STATE_UNATTACHED_SRC
        //Other detection types unsupported -> USB_STATE_UNATTACHED_SRC
        if (!usbc_cc_update()) {                                                        //Must have valid readings to continue
            usbc.state = USB_STATE_UNATTACHED_SRC;                                      //Invalid reading, detach
            return;                                                                     //Nothing more to be done
        } else {                                                                        //Valid CC readings to work with
            if (!USBC_IS_SINK((uint16_t)usbc_cc_a5_v_avg, (uint16_t)usbc_cc_b5_v_avg)) {    //If not a sink type
                usbc.state = USB_STATE_UNATTACHED_SRC;                                  //Detach
                return;                                                                 //Nothing more to be done
            } else {
                //Detected Sink for tCCDebounce -> USB_STATE_ATTACHED_SRC
                if (USBC_TIMER_DONE) {                                                  //Update timer and if timer complete
                    if (usb_attach_port_configure_kb(g_usb_host_port, (uint16_t)usbc_cc_a5_v_avg, (uint16_t)usbc_cc_b5_v_avg)) {  //If configuration was successful
                        usbc_5v_enable(1);                                              //Enable 5V bus
                        usbc.state = USB_STATE_ATTACHED_SRC;                            //Set next state
                        dprintf("USB Extra: Port enabled\n");
                    } else {                                                            //port was not configured
                        usbc.state = USB_STATE_UNATTACHED_SRC;                          //Set next state
                    }
                }
            }
        }
    }

    if (usbc.state == USB_STATE_ATTACHED_SRC) {
        //Sink Removed and VCONN was On -> USB_STATE_UNATTACHED_WAIT_SRC
        //Sink removed and VCONN was Off -> USB_STATE_UNATTACHED_SRC (Will always assume VCONN was On so ignoring this)
        if (!usbc_cc_update()) {                                    //Must have valid readings to continue
            usbc_5v_disable(1);                                     //Disable 5V bus
            usbc.state = USB_STATE_UNATTACHED_WAIT_SRC;             //Enter wait state for 5V bus discharge
            usbc.timer = USBC_CFG_TVCONNDISCHARGE;                  //Set timer for 5V bus discharge
            dprintf("USB Extra: Port disabled\n");
        } else {
            if (!USBC_IS_SINK((uint16_t)usbc_cc_a5_v_avg, (uint16_t)usbc_cc_b5_v_avg)) {    //Sink lost
                usbc_5v_disable(1);                                 //Disable 5V bus
                usbc.state = USB_STATE_UNATTACHED_WAIT_SRC;         //Enter wait state for 5V bus discharge
                usbc.timer = USBC_CFG_TVCONNDISCHARGE;              //Set timer for 5V bus discharge
                dprintf("USB Extra: Port disabled\n");
            }
        }
    }

    if (usbc.state == USB_STATE_UNATTACHED_WAIT_SRC) {
        //Discharge Complete and VCONN Off -> USB_STATE_UNATTACHED_SRC
        if (USBC_TIMER_DONE) {                                      //Update timer and if timer complete
            usbc.state = USB_STATE_UNATTACHED_SRC;                  //Set next state
        }
    }

    if (usbc.state == USB_STATE_DISABLED_WAIT) {
        //Wait complete -> USB_STATE_DISABLED
        if (USBC_TIMER_DONE) {                                      //Update timer and if timer complete
            usbc.state = USB_STATE_DISABLED;                        //Set next state
        }
    }

    if (usbc.state == USB_STATE_DISABLED_UNTIL_DETACH) {
        if (usbc_5v_is_enabled()) {
            usbc_5v_disable(1);                                     //Disable 5V bus
        }

        if (!usbc_cc_update()) {                                    //Must have valid readings to continue
            usbc.state = USB_STATE_UNATTACHED_WAIT_SRC;             //Enter wait state for 5V bus discharge
            usbc.timer = USBC_CFG_TVCONNDISCHARGE;                  //Set timer for 5V bus discharge
        } else {
            if (!USBC_IS_SINK((uint16_t)usbc_cc_a5_v_avg, (uint16_t)usbc_cc_b5_v_avg)) {    //Sink lost
                usbc.state = USB_STATE_UNATTACHED_WAIT_SRC;         //Enter wait state for 5V bus discharge
                usbc.timer = USBC_CFG_TVCONNDISCHARGE;              //Set timer for 5V bus discharge
            }
        }
    }
}

void USB_HandleExtraDevice(void) {
    usbc_task();
}

 #endif //MD_BOOTLOADER

#else

// *** STUB these for now for non HUB products.  Full implementation ***TBD
uint16_t usbc_cc_a5_v;
uint16_t usbc_cc_b5_v;
float usbc_cc_a5_v_avg;
float usbc_cc_b5_v_avg;

void usbc_cc_clear(void) {
    usbc_cc_a5_v = 0;
    usbc_cc_b5_v = 0;
    usbc_cc_a5_v_avg = 0.0f;
    usbc_cc_b5_v_avg = 0.0f;
}

void USB_HandleExtraDevice(void) {
    usbc_task();
}

void usbc_enable(void) {
    usbc.state = USB_STATE_UNATTACHED_WAIT_SRC;                     //Set starting state to discharge wait
    usbc.timer = USBC_CFG_TVCONNDISCHARGE;                          //Set timer for 5V bus discharge
    usbc_cc_clear();
}

void usbc_disable(void) {
    usbc.state = USB_STATE_DISABLED_WAIT;                           //Set disabled waiting state
    usbc.timer = USBC_CFG_TVCONNDISCHARGE;                          //Set timer for 5V bus discharge
    usbc_cc_clear();                                                //Clear CC readings
}

void usbc_task(void) {
	// ***TBD
}

#endif // NO_MD_USB2422
